{
  "users": [
    {
      "id": "001",
      "login": "danil",
      "password": "qwe123",
      "role_id": 0
    },
    {
      "id": "b657",
      "login": "ivan",
      "password": "qwe123",
      "role_id": 1
    }
  ],
  "roles": [
    {
      "id": 0,
      "name": "Администратор"
    },
    {
      "id": 1,
      "name": "Пользователь"
    },
    {
      "id": 2,
      "name": "Гость"
    }
  ],
  "tovary": [
    {
      "id": "001",
      "title": "ASUS GeForce GTX 1650 TUF Gaming OC Edition ",
      "image_url": "https://c.dns-shop.ru/thumb/st4/fit/200/200/3ba223b6aace8603b901347d8f9b1150/4901b338a7bd3001776d1fb8035ddbf786149b76fc53306292941bc9dc6fcd4b.jpg.webp",
      "content": "Видеокарта ASUS GeForce GTX 1650 TUF Gaming OC Edition [TUF-GTX1650-O4GD6-GAMING] обеспечивает высокий уровень производительности и надежности в составе игровой сборки. Графический процессор TU117 работает на частоте 1410 МГц, повышаемой до показателя 1680 МГц в режиме разгона. В оснащение видеокарты также входят 4 ГБ памяти стандарта GDDR6 с пропускной способностью 12 Гбит/с. Принадлежащий к экосистеме устройств серии TUF, графический адаптер ASUS GeForce GTX 1650 TUF Gaming OC Edition способен выдерживать длительные нагрузки и обладает усиленной конструкцией. Из интерфейсов предлагаются по одному разъему HDMI, DisplayPort и DVI-D. Система охлаждения с двумя вентиляторами быстро отводит тепло при любых показателях вычислительной мощности.",
      "price": "25000 руб",
      "categor_id": 0
    },
    {
      "id": "002",
      "title": "Видеокарта KFA2 GeForce RTX 4060 X Black [46NSL8MD8MEK]",
      "image_url": "https://c.dns-shop.ru/thumb/st4/fit/200/200/390b2d8f848989956f69e005969c8c5a/8100e0fe8ed7ff452a5b3d809e7c7d9ed155925a487471809cc45e713744bed9.jpg.webp",
      "content": "Процессор AMD Ryzen 5 3600 OEM создан для того, чтобы стать основой мощного геймерского компьютера. Он предлагает высокую производительность в играх и многозадачных сценариях использования благодаря 6 мощным ядрам и 12 потокам. Он также подходит для редактирования видео и работы с графикой. Частота функционирования процессора в стандартном режиме составляет 3.6 ГГц, в форсированном – до 4.2 ГГц. Также у него есть оперативная память на 3.2 ГГц. Опытных пользователей порадует, что процессор AMD Ryzen 5 3600 OEM поддерживает технологию виртуализации.",
      "price": "33 000 руб.",
      "categor_id": 1
    },
    {
      "image_url": "https://c.dns-shop.ru/thumb/st4/fit/500/500/6424ce4002d4731f93f2b4dc4189e3a0/5582e87ee92b0104f8803513b0d40afa7dc5140240e0ef2b26a770e512d26dd4.jpg.webp",
      "title": "Видеокарта KFA2 GeForce RTX 4060 X Black [46NSL8MD8MEK]",
      "content": "Видеокарта KFA2 GeForce RTX 4060 X Black [46NSL8MD8MEK] создана для компьютерных энтузиастов. Она обеспечивает высокую производительность, скорость и плавность графики. Архитектура Ada Lovelace с алгоритмами искусственного интеллекта DLSS 3 и технологией трассировки лучей обеспечивает реалистичную передачу деталей и оттенков. Процессор функционирует на частоте 1830 МГц, которая способна увеличиваться до значения 2565 МГц при разгоне.\nСистема с двумя вентиляторами стабильно отводит тепло и защищает видеокарту KFA2 GeForce RTX 4060 Ti X Black от перегрева. Прозрачные лопасти и интегрированные светодиоды ARGB формируют эффектное освещение с разноцветными оттенками. Из интерфейсов для вывода сигнала на боковой предлагаются 3 разъема DisplayPort и 1 разъем HDMI. Металлическая пластина на тыловой стороне делает видеокарту устойчивой к механическим воздействиям и деформации.",
      "price": "33 000 руб.",
      "categor_id": 0,
      "id": "tPEcHXG"
    },
    {
      "image_url": "https://c.dns-shop.ru/thumb/st1/fit/200/200/43d390a1e037fadc56258f5b239e0e6c/8650f24d3ba4df75e3f378043372178fa62fa5db5915fc7ac2d836192c9dffcb.jpg.webp",
      "title": "Процессор AMD Ryzen 9 7900X OEM ",
      "content": "Процессор AMD Ryzen 9 7900X – модель с впечатляющим вычислительным потенциалом, обеспеченным 12-ядерной конфигурацией и работой в частотном диапазоне 4.7-5.6 ГГц. Для подключения чипсета к материнской плате используется популярный сокет AM5. Созданная на базе архитектуры AMD Raphael модель использует 5-нанометровый техпроцесс, за счет которого обладает высокой производительностью и сниженным энергопотреблением. Объем кэша второго и третьего уровней достигает 12 МБ и 64 МБ соответственно, благодаря чему в нем можно хранить все необходимые для работы системы данные.\n\nПроцессор AMD Ryzen 9 7900X предусматривает свободный множитель, открывающий дополнительные возможности для повышения вычислительной мощи компьютера. С его помощью можно вручную изменить тактовую частоту чипсета, при этом оставив неизменной частоту системной шины. Бесперебойную работу в многозадачном режиме обеспечивает поддержка до 128 ГБ оперативной памяти DDR5.",
      "price": "43 000 руб.",
      "categor_id": 1,
      "id": "_3kZVAN"
    },
    {
      "image_url": "https://c.dns-shop.ru/thumb/st1/fit/200/200/dc206d2165f0709e25612def37bbbb86/58d92d84c46caaa7631e037da06f9f812ddb964a6322b8b7de59b4c61e13d755.jpg.webp",
      "title": "Процессор Intel Core i9-11900K OEM",
      "content": "Процессор Intel Core i9-11900K располагает встроенным контроллером PCI-E 4.0 с 20 линиями, что вместе с 8-ядерной конфигурацией и тактовой частотой 3.5 ГГц позволит использовать чипсет в мощной компьютерной сборке. Благодаря присутствию встроенного графического ядра Intel UHD Graphics 750 не придется приобретать дискретную видеокарту, устройство справится с обработкой нересурсоемкой графики. Тепловыделение модели не превышает 125 Вт, при этом модель способна функционировать при температуре нагрева до 100 °C.\n\nПроцессор Intel Core i9-11900K поддерживает использование в сборке оперативной памяти объемом до 128 ГБ, благодаря которой он справится с работой в многозадачном режиме. В данной модели реализован свободный множитель, который оценят поклонники разгона. С его помощью можно вручную настроить базовую частоту чипсета при неизменной частоте системной шины. Так можно добиться повышения производительности системы.",
      "price": "25 200 руб.",
      "categor_id": 1,
      "id": "VLBQSI-"
    }
  ],
  "categories": [
    {
      "id": 0,
      "name": "Видеокарта"
    },
    {
      "id": 1,
      "name": "Процессор"
    },
    {
      "id": 2,
      "name": "Материнские платы"
    },
    {
      "id": 3,
      "name": "Блоки питания"
    },
    {
      "id": 4,
      "name": "Оперативная память"
    }
  ],
  "sessions": []
}