{
	"users":[
		{
			"id": "001",
      		"login": "danil",
      		"password": "qwe123",
      		"role_id": 0
		}
	],
	"roles": [
		{
		  "id": 0,
		  "name": "Администратор"
		},
		{
		  "id": 1,
		  "name": "Пользователь"
		},
		{
		  "id": 2,
		  "name": "Гость"
		}
	  ],
	  "tovary":[
		{
			"id": "001",
			"title": "ASUS GeForce GTX 1650 TUF Gaming OC Edition",
			"image_url":"https://c.dns-shop.ru/thumb/st4/fit/200/200/3ba223b6aace8603b901347d8f9b1150/4901b338a7bd3001776d1fb8035ddbf786149b76fc53306292941bc9dc6fcd4b.jpg.webp" ,
			"content": "Видеокарта ASUS GeForce GTX 1650 TUF Gaming OC Edition [TUF-GTX1650-O4GD6-GAMING] обеспечивает высокий уровень производительности и надежности в составе игровой сборки. Графический процессор TU117 работает на частоте 1410 МГц, повышаемой до показателя 1680 МГц в режиме разгона. В оснащение видеокарты также входят 4 ГБ памяти стандарта GDDR6 с пропускной способностью 12 Гбит/с.<br><br>Принадлежащий к экосистеме устройств серии TUF, графический адаптер ASUS GeForce GTX 1650 TUF Gaming OC Edition способен выдерживать длительные нагрузки и обладает усиленной конструкцией. Из интерфейсов предлагаются по одному разъему HDMI, DisplayPort и DVI-D. Система охлаждения с двумя вентиляторами быстро отводит тепло при любых показателях вычислительной мощности.",
			"price": "25000 руб",
			"categor_id": 0
		},
		{
			"id": "002",
			"title": "AMD Ryzen 5 3600 OEM ",
			"image_url":"https://c.dns-shop.ru/thumb/st4/fit/200/200/390b2d8f848989956f69e005969c8c5a/8100e0fe8ed7ff452a5b3d809e7c7d9ed155925a487471809cc45e713744bed9.jpg.webp" ,
			"content": "Процессор AMD Ryzen 5 3600 OEM создан для того, чтобы стать основой мощного геймерского компьютера. Он предлагает высокую производительность в играх и многозадачных сценариях использования благодаря 6 мощным ядрам и 12 потокам. Он также подходит для редактирования видео и работы с графикой. Частота функционирования процессора в стандартном режиме составляет 3.6 ГГц, в форсированном – до 4.2 ГГц. Также у него есть оперативная память на 3.2 ГГц. Опытных пользователей порадует, что процессор AMD Ryzen 5 3600 OEM поддерживает технологию виртуализации.",
			"price": "8600 руб",
			"categor_id": 1
		}
	  ],
	  "categories": [
		{
		  "id": 0,
		  "name": "Видеокарта"
		},
		{
		  "id": 1,
		  "name": "Процессор"
		}
	  ]
}
