{
  "users": [
    {
      "id": "001",
      "login": "danil",
      "password": "qwe123",
      "role_id": 0
    },
    {
      "id": "b657",
      "login": "ivan",
      "password": "qwe123",
      "role_id": 1
    }
  ],
  "roles": [
    {
      "id": 0,
      "name": "Администратор"
    },
    {
      "id": 1,
      "name": "Пользователь"
    },
    {
      "id": 2,
      "name": "Гость"
    }
  ],
  "tovary": [
    {
      "id": "001",
      "title": "Видеокарта ASUS GeForce GTX 1650 TUF Gaming OC Edition ",
      "image_url": "https://c.dns-shop.ru/thumb/st4/fit/200/200/3ba223b6aace8603b901347d8f9b1150/4901b338a7bd3001776d1fb8035ddbf786149b76fc53306292941bc9dc6fcd4b.jpg.webp",
      "content": "Видеокарта ASUS GeForce GTX 1650 TUF Gaming OC Edition [TUF-GTX1650-O4GD6-GAMING] обеспечивает высокий уровень производительности и надежности в составе игровой сборки. Графический процессор TU117 работает на частоте 1410 МГц, повышаемой до показателя 1680 МГц в режиме разгона. В оснащение видеокарты также входят 4 ГБ памяти стандарта GDDR6 с пропускной способностью 12 Гбит/с. Принадлежащий к экосистеме устройств серии TUF, графический адаптер ASUS GeForce GTX 1650 TUF Gaming OC Edition способен выдерживать длительные нагрузки и обладает усиленной конструкцией. Из интерфейсов предлагаются по одному разъему HDMI, DisplayPort и DVI-D. Система охлаждения с двумя вентиляторами быстро отводит тепло при любых показателях вычислительной мощности.",
      "price": 25000,
      "categor_id": 1
    },
    {
      "id": "002",
      "title": "Процессор AMD Ryzen 5 3600 OEM",
      "image_url": "https://c.dns-shop.ru/thumb/st4/fit/200/200/390b2d8f848989956f69e005969c8c5a/8100e0fe8ed7ff452a5b3d809e7c7d9ed155925a487471809cc45e713744bed9.jpg.webp",
      "content": "Процессор AMD Ryzen 5 3600 OEM создан для того, чтобы стать основой мощного геймерского компьютера. Он предлагает высокую производительность в играх и многозадачных сценариях использования благодаря 6 мощным ядрам и 12 потокам. Он также подходит для редактирования видео и работы с графикой. Частота функционирования процессора в стандартном режиме составляет 3.6 ГГц, в форсированном – до 4.2 ГГц. Также у него есть оперативная память на 3.2 ГГц. Опытных пользователей порадует, что процессор AMD Ryzen 5 3600 OEM поддерживает технологию виртуализации.",
      "price": 9000,
      "categor_id": 2
    },
    {
      "image_url": "https://c.dns-shop.ru/thumb/st4/fit/500/500/6424ce4002d4731f93f2b4dc4189e3a0/5582e87ee92b0104f8803513b0d40afa7dc5140240e0ef2b26a770e512d26dd4.jpg.webp",
      "title": "Видеокарта KFA2 GeForce RTX 4060 X Black [46NSL8MD8MEK]",
      "content": "Видеокарта KFA2 GeForce RTX 4060 X Black [46NSL8MD8MEK] создана для компьютерных энтузиастов. Она обеспечивает высокую производительность, скорость и плавность графики. Архитектура Ada Lovelace с алгоритмами искусственного интеллекта DLSS 3 и технологией трассировки лучей обеспечивает реалистичную передачу деталей и оттенков. Процессор функционирует на частоте 1830 МГц, которая способна увеличиваться до значения 2565 МГц при разгоне.\nСистема с двумя вентиляторами стабильно отводит тепло и защищает видеокарту KFA2 GeForce RTX 4060 Ti X Black от перегрева. Прозрачные лопасти и интегрированные светодиоды ARGB формируют эффектное освещение с разноцветными оттенками. Из интерфейсов для вывода сигнала на боковой предлагаются 3 разъема DisplayPort и 1 разъем HDMI. Металлическая пластина на тыловой стороне делает видеокарту устойчивой к механическим воздействиям и деформации.",
      "price": 33000,
      "categor_id": 1,
      "id": "tPEcHXG"
    },
    {
      "image_url": "https://c.dns-shop.ru/thumb/st1/fit/200/200/43d390a1e037fadc56258f5b239e0e6c/8650f24d3ba4df75e3f378043372178fa62fa5db5915fc7ac2d836192c9dffcb.jpg.webp",
      "title": "Процессор AMD Ryzen 9 7900X OEM ",
      "content": "Процессор AMD Ryzen 9 7900X – модель с впечатляющим вычислительным потенциалом, обеспеченным 12-ядерной конфигурацией и работой в частотном диапазоне 4.7-5.6 ГГц. Для подключения чипсета к материнской плате используется популярный сокет AM5. Созданная на базе архитектуры AMD Raphael модель использует 5-нанометровый техпроцесс, за счет которого обладает высокой производительностью и сниженным энергопотреблением. Объем кэша второго и третьего уровней достигает 12 МБ и 64 МБ соответственно, благодаря чему в нем можно хранить все необходимые для работы системы данные.\n\nПроцессор AMD Ryzen 9 7900X предусматривает свободный множитель, открывающий дополнительные возможности для повышения вычислительной мощи компьютера. С его помощью можно вручную изменить тактовую частоту чипсета, при этом оставив неизменной частоту системной шины. Бесперебойную работу в многозадачном режиме обеспечивает поддержка до 128 ГБ оперативной памяти DDR5.",
      "price": 43000,
      "categor_id": 2,
      "id": "_3kZVAN"
    },
    {
      "image_url": "https://c.dns-shop.ru/thumb/st1/fit/200/200/dc206d2165f0709e25612def37bbbb86/58d92d84c46caaa7631e037da06f9f812ddb964a6322b8b7de59b4c61e13d755.jpg.webp",
      "title": "Процессор Intel Core i9-11900K OEM",
      "content": "Процессор Intel Core i9-11900K располагает встроенным контроллером PCI-E 4.0 с 20 линиями, что вместе с 8-ядерной конфигурацией и тактовой частотой 3.5 ГГц позволит использовать чипсет в мощной компьютерной сборке. Благодаря присутствию встроенного графического ядра Intel UHD Graphics 750 не придется приобретать дискретную видеокарту, устройство справится с обработкой нересурсоемкой графики. Тепловыделение модели не превышает 125 Вт, при этом модель способна функционировать при температуре нагрева до 100 °C.\n\nПроцессор Intel Core i9-11900K поддерживает использование в сборке оперативной памяти объемом до 128 ГБ, благодаря которой он справится с работой в многозадачном режиме. В данной модели реализован свободный множитель, который оценят поклонники разгона. С его помощью можно вручную настроить базовую частоту чипсета при неизменной частоте системной шины. Так можно добиться повышения производительности системы.",
      "price": 25200,
      "categor_id": 2,
      "id": "VLBQSI-"
    },
    {
      "image_url": "https://c.dns-shop.ru/thumb/st1/fit/200/200/d5b564aed673323d4588c53d321a5cf7/f59cfbb09342f6afc5c0b98feff7251ffadb21cfff1be82b59463a42c25a682d.jpg.webp",
      "title": "Материнская плата ASUS TUF GAMING B550M-PLUS WI-FI II",
      "content": "Базирующаяся на чипсете AMD B550 материнская плата ASUS TUF GAMING B550M-PLUS WI-FI II – яркий пример системной платы, рассчитанной на сборку компактного игрового компьютера. Модель, соответствующая форм-фактору Micro-ATX, имеет форму квадрата со сторонами 244 мм. Плата, оснащенная сокетом AM4, совместима с процессорами AMD с ядрами Matisse, Renoir и Vermeer. 3 слота расширения (2 PCI-E x16 и PCI-E x1) наверняка будут достаточны для установки не только видеокарты, но и необходимых пользователю контроллеров или адаптеров. Максимально допустимый объем оперативной памяти значителен – 128 ГБ. \nПлата оборудована четырьмя слотами DDR4. 2 разъема M.2 универсальны: они рассчитаны на установку как NWMe SSD, так и твердотельных накопителей, использующих для обмена данными интерфейс SATA.\nМатеринская плата ASUS TUF GAMING B550M-PLUS WI-FI II обращает на себя внимание наличием интегрированных контроллеров Bluetooth и Wi-Fi. Организация беспроводных соединений не потребует использования стороннего оборудования. Проводное сетевое подключение может осуществляться на скорости до 2.5 Гбит/с.",
      "price": 16500,
      "categor_id": 3,
      "id": "SxGqCzt"
    },
    {
      "image_url": "https://c.dns-shop.ru/thumb/st1/fit/200/200/ae51c5da1a8cfd32bf63220806e93203/e487a8ee2d6ddc3290d6143f937f08b568ef0bbdec649a3823e101b7437e8df0.png.webp",
      "title": "Материнская плата ASRock B760M Steel Legend WiFi",
      "content": "Материнская плата ASRock B760M Steel Legend WiFi оснащена всем необходимым для сборки высокопроизводительного игрового ПК. Она принадлежит к серии устройств компактного форм-фактора Micro-ATX. В плате реализованы 4 слота под установку до 192 ГБ оперативной памяти стандарта DDR5. Под графические адаптеры есть слот расширения PCI-E x16. Для создания вместительного хранилища из нескольких устройств предлагаются 3 разъема M.2 и 4 слота SATA.\n\nБеспроводная синхронизация осуществляется за счет интегрированного модуля с поддержкой Wi-Fi и Bluetooth. Для проводного соединения с Интернетом реализован контроллер LAN 2.5 Гбит/с. На панели интерфейсов расположены порты USB, видеовыходы DisplayPort и HDMI, разъемы аудио. ASRock B760M Steel Legend выделяется серебристыми охлаждающими радиаторами и гарантирует бесперебойную работу системы ПК.",
      "price": 18000,
      "categor_id": 3,
      "id": "4GOJOYC"
    },
    {
      "image_url": "https://c.dns-shop.ru/thumb/st1/fit/200/200/13b59eb0eecf3adc78ae9018e9feed06/2869cf7e285884cca45f70e53dab24ac79108a806b42982512478c1ef42727e4.jpg.webp",
      "title": "Блок питания DEEPCOOL PK800D [R-PK800D-FA0B-EU]",
      "content": "Блок питания DEEPCOOL PK800D [R-PK800D-FA0B-EU] соответствует сертификации 80+ Bronze, что подтверждает высокий уровень энергоэффективности и производительности. Модель рассчитана на мощность 800 Вт и подходит для создания надежной компьютерной системы для работы, игр или учебы. Высокопрочный корпус черного цвета устойчив к воздействию неблагоприятных факторов. Плоские кабели имеют оптимальную длину и облегчают укладку внутри системного блока.\n\nБлок питания DEEPCOOL PK800D [R-PK800D-FA0B-EU] оснащен активной системой вентиляции размером 120 мм, которая работает бесшумно и своевременно отводит тепло в зависимости от нагрузки. Благодаря преобразователю DC-DC, подача напряжения происходит более точно и изделие совместимо с комплектующими следующего поколения. Модель имеет высокую степень защиты от перебоев в сети и других неблагоприятных факторов.",
      "price": 5700,
      "categor_id": 4,
      "id": "rLQV_ce"
    },
    {
      "image_url": "https://c.dns-shop.ru/thumb/st1/fit/500/500/6741322843356c5116a54f540597f790/b3fc3afab57f67c10dea280621f836455209f1c4e895af7a5b67934995f8fa0c.png.webp",
      "title": "Оперативная память ADATA XPG Lancer Blade RGB [AX5U6000C3016G-SLABRBK] 16 ГБ",
      "content": "Оперативная память ADATA XPG Lancer Blade RGB [AX5U6000C3016G-SLABRBK] – оснащение для мощного игрового компьютера. Устройство рассчитано на установку в материнские платы со слотами DDR5. Объем модуля – 16 ГБ.\n\nТактовая частота оперативной памяти ADATA XPG Lancer Blade RGB [AX5U6000C3016G-SLABRBK] – 6000 МГц. Ее пропускная способность достаточна для продуктивной работы с любым программным обеспечением. Устройство подходит для комплектации производительных офисных и домашних ПК. Разгонный потенциал памяти реализуют технологии AMD EXPO и XMP 3.0. Тайминги модуля – 30-40-40. Технология On-Die ECC минимизирует программные сбои и улучшает стабильность системы. Поддержка частот от 4800 МГц расширяет совместимость устройства.\n\nПамять защищена от избыточного нагрева радиатором. Диапазон рабочих температур модели – от 0 до 85 °C. Напряжение питания модуля повышено до 1.35 В. Энергопотребление памяти оптимизирует технология Power Management IC. Украшение устройства – многоцветная подсветка.",
      "price": 6000,
      "categor_id": 5,
      "id": "74FuVKP"
    },
    {
      "image_url": "asdasd",
      "title": "asdasdasd",
      "content": "dasd",
      "price": 100000,
      "categor_id": 3,
      "id": "Shfx9UN"
    }
  ],
  "categories": [
    {
      "id": 0,
      "name": "Все"
    },
    {
      "id": 1,
      "name": "Видеокарта"
    },
    {
      "id": 2,
      "name": "Процессор"
    },
    {
      "id": 3,
      "name": "Материнские платы"
    },
    {
      "id": 4,
      "name": "Блоки питания"
    },
    {
      "id": 5,
      "name": "Оперативная память"
    }
  ],
  "sessions": []
}